export const faqs = [
  {
    id: 1,
    question: "كيف يمكنني التسجيل في الدورة؟",
    answer:
      'يمكنك التسجيل عبر اختيار الدورة التي ترغب بها ثم الضغط على زر "سجل الآن" واتباع الخطوات.',
  },
  {
    id: 2,
    question: "هل توجد شهادات معتمدة؟",
    answer:
      "نعم، يحصل كل متدرب على شهادة إتمام بعد النجاح في مشروع التخرج والمهام المطلوبة.",
  },
  {
    id: 3,
    question: "ما هي طرق الدفع المتاحة؟",
    answer: "نقبل الدفع النقدي، فيزا، فودافون كاش، والتحويلات البنكية.",
  },
  {
    id: 4,
    question: "هل يمكنني مشاهدة محتوى الدورة قبل التسجيل؟",
    answer:
      "نعم، يمكنك الاطلاع على تفاصيل الدورة والمحتوى التدريبي والمشروعات قبل التسجيل.",
  },
  {
    id: 5,
    question: "هل الدورة مناسبة للمبتدئين؟",
    answer:
      "نعم، تختلف المتطلبات حسب الدورة، وستجد في صفحة كل دورة المستوى المطلوب قبل التسجيل.",
  },
  {
    id: 6,
    question: "هل يوجد دعم أثناء فترة التدريب؟",
    answer:
      "نعم، يحصل المتدرب على الدعم والإرشاد خلال فترة التدريب لمساعدته على فهم المحتوى وتنفيذ المهام والمشروعات.",
  },
];
