export const features = [
  {
    id: 1,
    icon: "TbSchool",
    title: "محتوى تدريبي عملي",
    description:
      "نقدم دورات تعتمد على التطبيق الفعلي لضمان اكتساب مهارات حقيقية يمكن استخدامها مباشرة في سوق العمل.",
  },
  {
    id: 2,
    icon: "TbDeviceLaptop",
    title: "مدربون بخبرة احترافية",
    description:
      "يتم تقديم الكورسات بواسطة نخبة من المتخصصين ذوي الخبرة العملية في مجالاتهم المختلفة.",
  },
  {
    id: 3,
    icon: "TbRosetteDiscountCheck",
    title: "مسارات تعليمية متكاملة",
    description:
      "نوفر برامج تدريبية منظمة تساعدك على التدرج من المستوى المبتدئ إلى الاحترافي بخطوات واضحة.",
  },
  {
    id: 4,
    icon: "TbCertificate",
    title: "شهادات معتمده",
    description:
      "نقدم شهادات معتمدة رسميًا من نقابة المهندسين المصرية، مما يمنح سيرتك الذاتية قيمة مضافة ويعزز من فرص قبولك وتطورك المهني.",
  },
];
