export const journeySteps = [
  {
    id: 1,
    title: "هيكل الدبلومة",
    icon: "FiBookOpen",
    description: "تنظيم المحتوى والربط بالتطبيق العملي",
    points: [
      "تقسيم المحتوى إلى وحدات تعليمية متسلسلة و مترابطة تضمن بناء المعرفة بشكل تدريجي.",
      "ربط كل وحدة بتطبيقات عملية وورش عمل لترسيخ المفاهيم وتحويلها إلى مهارات قابلة للتنفيذ.",
      "الانتقال من الأساسيات إلى المشاريع المتقدمة وفق خطة واضحة تحاكي احتياجات سوق العمل.",
      "متابعة مستمرة لقياس التقدم وضمان الاستعداد للمراحل التالية من الرحلة التعليمية.",
    ],
  },

  {
    id: 2,
    title: "نظام التقييم الشامل",
    icon: "FiCheckSquare",
    description: "قياس الأداء ومعايير الانتقال والقبول",
    points: [
      "تقييم مستمر يركز على الحضور، الالتزام، تسليم الـ Tasks، وجودة التطبيق العملي.",
      "قياس مستوى الطالب بشكل دوري لتحديد مدى جاهزيته للانتقال إلى المراحل المتقدمة.",
      "يشترط في بعض الأنشطة والبرامج العملية تحقيق نسبة تقييم لا تقل عن 90% لضمان الاستفادة الكاملة من التجربة.",
      "تقديم Feedback مستمر يساعد الطالب على معرفة نقاط القوة وفرص التحسين خلال رحلته التعليمية.",
    ],
  },

  {
    id: 3,
    title: "ورش العمل",
    icon: "FiUsers",
    description: "بيئة تطبيقية تحاكي تحديات سوق العمل",
    points: [
      "تطبيق عملي على مشاريع وسيناريوهات تحاكي احتياجات الشركات وسوق العمل تحت إشراف مدربين خبراء في المجال.",
      "تُنظم بشكل دوري للطلاب المؤهلين و الحاصلين علي اكثر90% من التقييم، بهدف رفع مستوى التطبيق واكتساب خبرات عملية متقدمة.",
      "تنمية مهارات تحليل المشكلات، والعمل على حلول تقنية وفق أساليب احترافية.",
      "تعزيز الثقة في تنفيذ المشاريع والاستعداد للتعامل مع التحديات التي يواجهها المطورون في بيئة العمل.",
    ],
  },

  {
    id: 4,
    title: "معسكرات إيراسوفت",
    icon: "FiZap",
    description: "المشاريع المتكاملة وتطوير العمل الجماعي",
    points: [
      "تنفيذ مشروع متكامل من الفكرة وحتى المنتج النهائي من خلال تجربة تطبيقية مكثفة.",
      "العمل ضمن فريق باستخدام أساليب وأدوات التعاون المتبعة في بيئات العمل التقنية داخل الشركات .",
      "مخصصة للطلاب المتميزين الذين أثبتوا جاهزيتهم للانتقال إلى مراحل تطبيقية أكثر تقدمًا.",
      "تُنظم بشكل دوري للطلاب المؤهلين الذين أثبتوا جاهزيتهم للانتقال إلى مراحل تطبيقية أكثر تقدمًا.",
    ],
  },

  {
    id: 5,
    title: " يوم العمل (Job Day)",
    icon: "FiBriefcase",
    description: "عِش تجربة يوم عمل حقيقي داخل شركة برمجيات",
    points: [
      "محاكاة كاملة لدورة العمل باستخدام أدوات إدارة المشاريع والتعاون بين الفرق التقنية.",
      "تنفيذ المهام ضمن فريق عمل مع متابعة التقدم وعقد اجتماعات دورية وعرض نتائج للمشاريع في Demo Sessions.",
      "اكتساب خبرة عملية في إدارة الوقت، التواصل، والعمل وفق معايير بيئة الشركات.",
      "يكون متاحاًً للطلاب المؤهلين الذين استوفوا معايير الأداء والجاهزية للانتقال إلى هذه المرحلة.",
    ],
  },

  {
    id: 6,
    title: "تأثير إيراسوفت",
    icon: "FiPocket",
    description: "التأهيل المهني و المهارات الشخصية لسوق العمل",
    points: [
      "بناء CV احترافي متوافق مع أنظمة الفرز الآلي (ATS) لزيادة فرص وصوله إلى مسؤولي التوظيف.",
      "تحسين حساب LinkedIn وبناء هوية مهنية تعكس مهاراتك ومشاريعك بشكل احترافي لجذب مسؤولي التوظيف.",
      "الاستعداد للمقابلات الشخصية من خلال التدريب على الأسئلة الفنية و الشخصيه وأساليب التواصل الاحترافي.",
      "تطوير مهارات التواصل داخل بيئة العمل، بما في ذلك أساسيات اللغة الإنجليزية المستخدمة في المجال التقني.",
      "حضور Freelancing Workshops للتعرف على كيفية التسعير، والتعامل مع العملاء، وكتابة العروض (Proposals)، وإدارة المشاريع على منصات العمل الحر.",
    ],
  },

  {
    id: 7,
    title: "مشروع التخرج  (EGP)",
    icon: "FiAward",
    description:
      "أكبر حدث تقني سنوي يجمع طلاب Eraa Soft بقادة وخبراء سوق التكنولوجيا",
    points: [
      "عرض ومناقشة مشاريع التخرج أمام خبراء و seniors من شركات التكنولوجيا ، مع الحصول على تقييم وFeedback احترافي يساعد على تطوير المشروع قبل الانطلاق لسوق العمل.",
      "جلسات ملهمة (Tech Talks) يقدمها مؤثرون وخبراء في مجالات البرمجة و تحليل البيانات و الـ AI يشاركون خلالها خبراتهم العملية وأهم التحديات التي واجهوها وكيف وصلوا إلى النجاح.",
      "لقاءات مباشرة مع شركات التكنولوجيا وشركاء Eraa Soft للتعرف على متطلبات التوظيف، وبناء شبكة علاقات مهنية مع أصحاب الخبرة وصناع القرار في المجال.",
      "بناء شبكة علاقات مهنية (Networking) مع عدد كبير من الطلاب والخريجين والمهندسين والمتخصصين، بما يفتح أبوابًا لفرص التعاون والعمل مستقبلًا.",
      "التعرف على أحدث اتجاهات سوق التكنولوجيا والمهارات التي تبحث عنها الشركات، وكيف تستعد للمنافسة في سوق العمل المحلي والعالمي.",
      "الاحتفال بإنجازات الطلاب في حدث سنوي يجمع المجتمع التقني، ويمنح كل طالب فرصة لعرض ما أنجزه أمام جمهور من المتخصصين والمهتمين بالتكنولوجيا.",
      "الانتقال من مرحلة التعلم إلى مرحلة الاحتراف من خلال تجربة متكاملة تجمع بين المعرفة، والتطبيق، والتقييم، والتواصل، وفرص الانطلاق نحو سوق العمل.",
    ],
  },

  {
    id: 8,
    title: "EraaSoft Community",
    icon: "FiStar",
    description: "مجتمع تفاعلي مستمر لدعم النمو المهني والتوظيف",
    points: [
      "ربط الطلاب والخريجين بشبكة واسعة من الشركات وأصحاب الأعمال لتسهيل التوظيف.",
      "متابعة أحدث التطورات في مجالات البرمجة، والذكاء الاصطناعي، وتحليل البيانات، والأمن السيبراني و غيرهم من خلال فعاليات ومحتوى متخصص.",
      "حضور لقاءات وفعاليات حصرية مع خبراء الصناعة لمناقشة أحدث الاتجاهات ومتطلبات سوق العمل.",
      "الاستفادة من مزايا حصرية مقدمة من شركاء Eraa Soft، مثل خصومات على برامج اللغة الإنجليزية، والدورات المتخصصة، والخدمات المهنية الاخري",
      "توسيع شبكة علاقاتك المهنية (Networking) والتواصل مع طلاب وخريجين وخبراء يشاركونك نفس الاهتمامات والطموحات.",
      "دعم مهني مستمر من خلال جلسات إرشادية، ومشاركة الخبرات، وتبادل المعرفة داخل مجتمع تقني نشط.",
    ],
  },
];
